DataProcessors/НастройкиПравилИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>НастройкиПравилИспользования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецПравилИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимыеТипыИспользования</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоПравил</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПравилаИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПравилаИспользования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравилИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/НастройкиПравилИспользования/Ext/ObjectModule.bsl
# Если Клиент Тогда

// Процедура считывает настройки правил использования данного объекта.
//
Процедура ДеревоПравилПрочитать(Ссылка, ОписаниеТипов, Элемент, Принудительно = Ложь) Экспорт
	
	// Проверка заполнялись ли уже данные.
	Если Не(ЗначениеЗаполнено(Принудительно) И Принудительно) И (Не ДеревоПравил.Строки.Количество() = 0) И (ВладелецПравилИспользования = Ссылка) И (ДопустимыеТипыИспользования = ОписаниеТипов) Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецПравилИспользования = Ссылка;
	ДопустимыеТипыИспользования = ОписаниеТипов;
	
	// Очистка дерева.
	ДеревоПравил.Строки.Очистить();
	
	// Добавление колонок.
	Если (ДеревоПравил.Колонки.Найти("Актуальность") = Неопределено) Тогда
		ДеревоПравил.Колонки.Добавить("Актуальность", Новый ОписаниеТипов("Булево"), "Объекты");
	КонецЕсли;
	
	// Перенос и настройка колонок.
	Элемент.СоздатьКолонки();
	Элемент.Колонки.Актуальность.ДанныеФлажка = Элемент.Колонки.Актуальность.Данные;
	Элемент.Колонки.Актуальность.Данные = Неопределено;
	Элемент.Колонки.Актуальность.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	Элемент.Колонки.Актуальность.Ширина = 10;
	
	
	// Добавление служебных колонок.
	Если (ДеревоПравил.Колонки.Найти("Наименование") = Неопределено) Тогда
		ДеревоПравил.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	Если (ДеревоПравил.Колонки.Найти("ОбъектИспользования") = Неопределено) Тогда
		ДеревоПравил.Колонки.Добавить("ОбъектИспользования", ДопустимыеТипыИспользования);
	КонецЕсли;
	Если (ДеревоПравил.Колонки.Найти("ЭтоТип") = Неопределено) Тогда
		ДеревоПравил.Колонки.Добавить("ЭтоТип");
	КонецЕсли;
	Если (ДеревоПравил.Колонки.Найти("ЭтоВладелец") = Неопределено) Тогда
		ДеревоПравил.Колонки.Добавить("ЭтоВладелец");
	КонецЕсли;
	Если (ДеревоПравил.Колонки.Найти("ЭтоГруппа") = Неопределено) Тогда
		ДеревоПравил.Колонки.Добавить("ЭтоГруппа");
	КонецЕсли;
	
	
	// Выборка данных из регистра.
	Если ВладелецПравилИспользования.Пустая() Тогда
		ТаблицаРезультатаЗапроса = Новый ТаблицаЗначений();
		ТаблицаРезультатаЗапроса.Колонки.Добавить("ОбъектИспользования");
	Иначе
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ОбъектИспользования,
			|	Актуальность
			|ИЗ
			|	РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
			|ГДЕ
			|	ПравилаИспользования.ВладелецПравилИспользования = &ВладелецПравилИспользования
			|");
		Запрос.УстановитьПараметр("ВладелецПравилИспользования", ВладелецПравилИспользования);
		ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	
	// Заполнение данных.
	Для Каждого ДопустимыйТипы Из ДопустимыеТипыИспользования.Типы() Цикл
		// -- Тип значения строкой.
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ДопустимыйТипы);
		Если Не Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		
		// -- Добавление в дерево типа.
		КорневаяСтрокаТипа = ДеревоПравил.Строки.Добавить();
		КорневаяСтрокаТипа.Наименование = ОбъектМетаданных.Синоним;
		КорневаяСтрокаТипа.ОбъектИспользования = Справочники[ОбъектМетаданных.Имя].ПустаяСсылка();
		КорневаяСтрокаТипа.ЭтоТип = Истина;
		КорневаяСтрокаТипа.ЭтоВладелец = Ложь;
		КорневаяСтрокаТипа.ЭтоГруппа = Ложь;
		СтрокаТаблицыЗначений = ТаблицаРезультатаЗапроса.Найти(КорневаяСтрокаТипа.ОбъектИспользования, "ОбъектИспользования");
		КорневаяСтрокаТипа.Актуальность = (СтрокаТаблицыЗначений = Неопределено) Или СтрокаТаблицыЗначений.Актуальность;
		
		// -- Формирование запроса.
		Если (ОбъектМетаданных = Метаданные.Справочники.Меню) Тогда
			Наименование = "Номенклатура";
		Иначе
			Наименование = "Наименование";
		КонецЕсли;
		Если (ОбъектМетаданных.Владельцы.Количество() = 0) Тогда
			Если (ОбъектМетаданных.Иерархический) Тогда
				Если (ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда
					//ТекстЗапроса = "ВЫБРАТЬ ЛОЖЬ КАК ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник ГДЕ НЕ Справочник.ПометкаУдаления УПОРЯДОЧИТЬ ПО Ссылка ИЕРАРХИЯ, Наименование";
					ТекстЗапроса = "ВЫБРАТЬ ЛОЖЬ КАК ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник УПОРЯДОЧИТЬ ПО Ссылка ИЕРАРХИЯ, Наименование";
				Иначе
					//ТекстЗапроса = "ВЫБРАТЬ Справочник.ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник ГДЕ НЕ Справочник.ПометкаУдаления УПОРЯДОЧИТЬ ПО ЭтоГруппа ИЕРАРХИЯ, Наименование";
					ТекстЗапроса = "ВЫБРАТЬ Справочник.ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник УПОРЯДОЧИТЬ ПО ЭтоГруппа ИЕРАРХИЯ, Наименование";
				КонецЕсли;
			Иначе
				//ТекстЗапроса = "ВЫБРАТЬ Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник ГДЕ НЕ Справочник.ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование";
				ТекстЗапроса = "ВЫБРАТЬ Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник УПОРЯДОЧИТЬ ПО Наименование";
			КонецЕсли;
		Иначе
			Если (ОбъектМетаданных.Иерархический) Тогда
				Если (ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда
					//ТекстЗапроса = "ВЫБРАТЬ ЛОЖЬ КАК ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель, Справочник.Владелец ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник ГДЕ НЕ Справочник.ПометкаУдаления УПОРЯДОЧИТЬ ПО Владелец.Представление, Ссылка ИЕРАРХИЯ, Наименование";
					ТекстЗапроса = "ВЫБРАТЬ ЛОЖЬ КАК ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель, Справочник.Владелец ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник УПОРЯДОЧИТЬ ПО Владелец.Представление, Ссылка ИЕРАРХИЯ, Наименование";
				Иначе
					//ТекстЗапроса = "ВЫБРАТЬ Справочник.ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель, Справочник.Владелец ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник ГДЕ НЕ Справочник.ПометкаУдаления УПОРЯДОЧИТЬ ПО Владелец.Представление, ЭтоГруппа ИЕРАРХИЯ, Наименование";
					ТекстЗапроса = "ВЫБРАТЬ Справочник.ЭтоГруппа, Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Родитель, Справочник.Владелец ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник УПОРЯДОЧИТЬ ПО Владелец.Представление, ЭтоГруппа ИЕРАРХИЯ, Наименование";
				КонецЕсли;
			Иначе
				//ТекстЗапроса = "ВЫБРАТЬ Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Владелец ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник ГДЕ НЕ Справочник.ПометкаУдаления УПОРЯДОЧИТЬ ПО Владелец.Представление, Наименование";
				ТекстЗапроса = "ВЫБРАТЬ Справочник.Ссылка, Справочник." + Наименование + " КАК Наименование, Справочник.Владелец ИЗ Справочник." + ОбъектМетаданных.Имя + " КАК Справочник УПОРЯДОЧИТЬ ПО Владелец.Представление, Наименование";
			КонецЕсли;
		КонецЕсли;
	
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Продолжить;
		КонецЕсли;

		// ---- Обход запроса.
		Выборка = РезультатЗапроса.Выбрать();
		Если (ОбъектМетаданных.Иерархический) Тогда
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.Родитель.Пустая() Тогда
					СтрокаГруппы = КорневаяСтрокаТипа;
					// ------ Владелец.
					Если (Не ОбъектМетаданных.Владельцы.Количество() = 0) Тогда
						СтрокаГруппы = СтрокаГруппы.Строки.Найти(Выборка.Владелец, "ОбъектИспользования", Истина);
						Если (СтрокаГруппы = Неопределено) Тогда
							СтрокаЭлемент = КорневаяСтрокаТипа.Строки.Добавить();
							СтрокаЭлемент.Наименование = Строка(Выборка.Владелец);
							СтрокаЭлемент.ОбъектИспользования = Выборка.Владелец;
							СтрокаЭлемент.ЭтоТип = Ложь;
							СтрокаЭлемент.ЭтоВладелец = Истина;
							СтрокаЭлемент.ЭтоГруппа = Ложь;
							СтрокаЭлемент.Актуальность = Истина;
							СтрокаГруппы = СтрокаЭлемент;
						КонецЕсли;
					КонецЕсли;
				Иначе
					СтрокаГруппы = ДеревоПравил.Строки.Найти(Выборка.Родитель, "ОбъектИспользования", Истина);
				КонецЕсли;		
				
				СтрокаЭлемент = СтрокаГруппы.Строки.Добавить();
				СтрокаЭлемент.Наименование = Выборка.Наименование;
				СтрокаЭлемент.ОбъектИспользования = Выборка.Ссылка;
				СтрокаЭлемент.ЭтоТип = Ложь;
				СтрокаЭлемент.ЭтоВладелец = Ложь;
				СтрокаЭлемент.ЭтоГруппа = Выборка.ЭтоГруппа;
				СтрокаТаблицыЗначений = ТаблицаРезультатаЗапроса.Найти(СтрокаЭлемент.ОбъектИспользования, "ОбъектИспользования");
				СтрокаЭлемент.Актуальность = (СтрокаТаблицыЗначений = Неопределено) Или СтрокаТаблицыЗначений.Актуальность;
			КонецЦикла;
			
		Иначе
			
			Пока Выборка.Следующий() Цикл
				СтрокаГруппы = КорневаяСтрокаТипа;
				// ------ Владелец.
				Если (Не ОбъектМетаданных.Владельцы.Количество() = 0) Тогда
					СтрокаГруппы = СтрокаГруппы.Строки.Найти(Выборка.Владелец, "ОбъектИспользования", Истина);
					Если (СтрокаГруппы = Неопределено) Тогда
						СтрокаЭлемент = КорневаяСтрокаТипа.Строки.Добавить();
						СтрокаЭлемент.Наименование = Строка(Выборка.Владелец);
						СтрокаЭлемент.ОбъектИспользования = Выборка.Владелец;
						СтрокаЭлемент.ЭтоТип = Ложь;
						СтрокаЭлемент.ЭтоВладелец = Истина;
						СтрокаЭлемент.ЭтоГруппа = Ложь;
						СтрокаЭлемент.Актуальность = Истина;
						СтрокаГруппы = СтрокаЭлемент;
					КонецЕсли;
				КонецЕсли;
					
				// ---- Добавление в дерево элемента.
				СтрокаЭлемент = СтрокаГруппы.Строки.Добавить();
				СтрокаЭлемент.Наименование = Выборка.Наименование;
				СтрокаЭлемент.ОбъектИспользования = Выборка.Ссылка;
				СтрокаЭлемент.ЭтоТип = Ложь;
				СтрокаЭлемент.ЭтоВладелец = Ложь;
				СтрокаЭлемент.ЭтоГруппа = Ложь;
				СтрокаТаблицыЗначений = ТаблицаРезультатаЗапроса.Найти(СтрокаЭлемент.ОбъектИспользования, "ОбъектИспользования");
				СтрокаЭлемент.Актуальность = (СтрокаТаблицыЗначений = Неопределено) Или СтрокаТаблицыЗначений.Актуальность;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ДеревоПравилПрочитать()

// Процедура при необходимости изменяет настройки правил использования данного объекта.
//
Процедура ДеревоПравилЗаписать(Ссылка, Отказ, Удалить = Ложь) Экспорт
	
	// Запись уже была прервана, продолжение не имеет смысла.
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецПравилИспользования = Ссылка;
	
	// Нормализация.
	Удалить = (Не Удалить = Неопределено) И Удалить;
	
	// Запись набора записей.
	НаборЗаписей = РегистрыСведений.ПравилаИспользования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВладелецПравилИспользования.Использование = Истина;
	НаборЗаписей.Отбор.ВладелецПравилИспользования.Значение = ВладелецПравилИспользования;
	
	// Нисходящий обход дерева.
	СписокПодчиненных = Новый СписокЗначений();
	СписокПодчиненных.Добавить(ДеревоПравил);

	Для Каждого СтрокаВладелец Из СписокПодчиненных Цикл
		СтрокаВладелец = СтрокаВладелец.Значение;	// Наепка - друг чекиста ;)
		
		Для Каждого СтрокаВладельца Из СтрокаВладелец.Строки Цикл
			Если (Удалить) Тогда
				СтрокаВладельца.Актуальность = Истина;
			Иначе
				// -- Добавление данных в набор записей.
				Если (Не СтрокаВладельца.ЭтоВладелец) И (Не СтрокаВладельца.Актуальность) Тогда
					Запись = НаборЗаписей.Добавить();
					Запись.ОбъектИспользования = СтрокаВладельца.ОбъектИспользования;
					Запись.ВладелецПравилИспользования = ВладелецПравилИспользования;
					Запись.Актуальность = СтрокаВладельца.Актуальность;
				КонецЕсли;
			КонецЕсли;
					
			Если (Не СтрокаВладельца.Строки.Количество() = 0) Тогда
				СписокПодчиненных.Добавить(СтрокаВладельца);
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;

	// Запись набора записей.
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), Отказ, ,, НаборЗаписей, ВладелецПравилИспользования);
	КонецПопытки;
	
КонецПроцедуры // ДеревоПравилЗаписать()

// Обработчик события ДеревоПравил.ПриВыводеСтроки элемента.
//
Процедура ДеревоПравилВывестиСтроку(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	// Актуальность.
	Если Элемент.Колонки.Актуальность.Видимость Тогда
		ОформлениеСтроки.Ячейки.Актуальность.ОтображатьКартинку = Истина;
		Если ДанныеСтроки.ЭтоТип Тогда
			ОформлениеСтроки.Ячейки.Актуальность.Картинка = БиблиотекаКартинок.СправочникОбъект;
			ОформлениеСтроки.Ячейки.Актуальность.ОтображатьФлажок = Ложь;
			ОформлениеСтроки.Ячейки.Актуальность.ТолькоПросмотр = Истина;
		ИначеЕсли ДанныеСтроки.ЭтоВладелец Тогда
			ОформлениеСтроки.Ячейки.Актуальность.Картинка = БиблиотекаКартинок.ВладелецСправочника;
			ОформлениеСтроки.Ячейки.Актуальность.ТолькоПросмотр = Истина;
		ИначеЕсли ДанныеСтроки.ЭтоГруппа Тогда
			ОформлениеСтроки.Ячейки.Актуальность.Картинка = БиблиотекаКартинок.ГруппаСправочника;
		Иначе
			ОформлениеСтроки.Ячейки.Актуальность.Картинка = БиблиотекаКартинок.ЭлементСправочника;
		КонецЕсли;
		ОформлениеСтроки.Ячейки.Актуальность.УстановитьТекст(ДанныеСтроки.Наименование);
	КонецЕсли;
	
КонецПроцедуры // ДеревоПравилВывестиСтроку()

// Обработчик события ДеревоПравил.ПриИзмененииФлажка элемента.
//
Процедура ДеревоПравилИзменитьФлажок(Элемент, Колонка) Экспорт
	
	СтрокаДерева = Элемент.ТекущаяСтрока;
	
	// Изменение подчиненных.
	Если (Не СтрокаДерева.Строки.Количество() = 0) Тогда
		// -- Нисходящий обход дерева.
		СписокПодчиненных = Новый СписокЗначений();
		СписокПодчиненных.Добавить(СтрокаДерева);
	
		Для Каждого СтрокаВладелец Из СписокПодчиненных Цикл
			СтрокаВладелец = СтрокаВладелец.Значение;	// Наепка - друг чекиста ;)
			
			Для Каждого СтрокаВладельца Из СтрокаВладелец.Строки Цикл
				СтрокаВладельца.Актуальность = СтрокаДерева.Актуальность;
						
				Если (Не СтрокаВладельца.Строки.Количество() = 0) Тогда
					СписокПодчиненных.Добавить(СтрокаВладельца);
				КонецЕсли;
			КонецЦикла;
		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ДеревоПравилИзменитьФлажок()

#КонецЕсли
